## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 0 to add, 3 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_inventory_cartography_state_machine"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "iam:GetRole",
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::794722365809:role/cartography_container_execution_role",
              + "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
            ]
        }
      + statement {
          + actions   = [
              + "states:StartExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography",
            ]
        }
      + statement {
          + actions   = [
              + "ecs:ListTasks",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecs:RunTask",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
              + "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5",
            ]
        }
      + statement {
          + actions   = [
              + "events:DescribeRule",
              + "events:PutRule",
              + "events:PutTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:events:ca-central-1:794722365809:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:794722365809:function:sentinel-neo4j-forwarder",
            ]
        }
    }

  # data.template_file.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "asset_inventory_cartography_state_machine"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            {
              "Comment": "Run daily asset inventory of cloud assets",
              "TimeoutSeconds": 86400,
              "StartAt": "Get AWS accounts",
              "States": {
                "Get AWS accounts": {
                  "Type": "Task",
                  "Next": "Map",
                  "Parameters": {
                    "Name": "/cartography/asset_inventory_account_list"
                  },
                  "Resource": "arn:aws:states:::aws-sdk:ssm:getParameter",
                  "ResultSelector": {
                    "accounts.$": "States.StringToJson($.Parameter.Value)"
                  }
                },
                "Map": {
                  "Type": "Map",
                  "Iterator": {
                    "StartAt": "Pass",
                    "States": {
                      "Pass": {
                        "Type": "Pass",
                        "Next": "Cartography",
                        "Parameters": {
                          "account.$": "$"
                        }
                      },
                      "Cartography": {
                        "Type": "Task",
                        "Resource": "arn:aws:states:::ecs:runTask.sync",
                        "Parameters": {
                          "Cluster": "${CARTOGRAPHY_CLUSTER}",
                          "CapacityProviderStrategy": [
                            {
                              "Base": ${MIN_ECS_CAPACITY},
                              "CapacityProvider": "FARGATE_SPOT",
                              "Weight": ${MAX_ECS_CAPACITY}
                            },
                            {
                              "Base": 0,
                              "CapacityProvider": "FARGATE",
                              "Weight": ${MIN_ECS_CAPACITY}
                            }
                          ],
                          "TaskDefinition": "${CARTOGRAPHY_TASK_DEF}",
                          "Overrides": {
                            "ContainerOverrides": [
                              {
                                "Name": "${CARTOGRAPHY_SERVICE_NAME}",
                                "Environment": [
                                  {
                                    "Name": "AWS_ACCOUNT",
                                    "Value.$": "$.account"
                                  },
                                  {
                                    "Name": "AWS_CONFIG_FILE",
                                    "Value": "/config/role_config"
                                  },
                                  {
                                    "Name": "NEO4J_URI",
                                    "Value": "bolt://neo4j.internal.local:7687"
                                  },
                                  {
                                    "Name": "NEO4J_USER",
                                    "Value": "neo4j"
                                  }
                                ]
                              }
                            ]
                          },
                          "NetworkConfiguration": {
                            "AwsvpcConfiguration": {
                              "SecurityGroups": ["${SECURITY_GROUPS}"],
                              "Subnets":[${SUBNETS}]
                            }
                          }
                        },
                        "Retry": [
                          {
                            "ErrorEquals": ["States.TaskFailed"],
                            "IntervalSeconds": 120,
                            "MaxAttempts": 4
                          }
                        ],
                        "End": true
                      }
                    }
                  },
                  "MaxConcurrency": 1,
                  "ItemsPath": "$.accounts",
                  "ResultPath": null,
                  "Next": "Neo4J Sentinel Forwarder"
                },
                "Neo4J Sentinel Forwarder" : {
                  "Type" : "Task",
                  "Resource" : "arn:aws:states:::lambda:invoke",
                  "Parameters" : {
                    "FunctionName" : "${NEO4J_SENTINEL_FORWARDER_LAMBDA}"
                  },
                  "End": true
                }
              }
            }
        EOT
      + vars     = {
          + "CARTOGRAPHY_CLUSTER"             = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
          + "CARTOGRAPHY_SERVICE_NAME"        = "cartography"
          + "CARTOGRAPHY_TASK_DEF"            = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5"
          + "MAX_ECS_CAPACITY"                = "5"
          + "MIN_ECS_CAPACITY"                = "1"
          + "NEO4J_SENTINEL_FORWARDER_LAMBDA" = "arn:aws:lambda:ca-central-1:794722365809:function:sentinel-neo4j-forwarder:$LATEST"
          + "SECURITY_GROUPS"                 = "sg-03caf974f268a3efb"
          + "SUBNETS"                         = "\"subnet-08cab5daf34489c53\", \"subnet-07f8e17bbf11b0797\", \"subnet-0d92713028fd15243\""
        }
    }

  # aws_iam_policy.asset_inventory_cartography_state_machine will be updated in-place
  ~ resource "aws_iam_policy" "asset_inventory_cartography_state_machine" {
        id        = "arn:aws:iam::794722365809:policy/CartographyStateMachineECSLambda"
        name      = "CartographyStateMachineECSLambda"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:4",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:794722365809:function:sentinel-neo4j-forwarder"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.neo4j_to_sentinel will be updated in-place
  ~ resource "aws_lambda_function" "neo4j_to_sentinel" {
        id                             = "sentinel-neo4j-forwarder"
      ~ last_modified                  = "2022-05-17T13:27:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "EmXGTJ58AtaSLVjEsjLwCulpzepPEWffLmZiILFVq28=" -> "OxbaX0HEfPlyiAQMojHfaHsbvZ4om+a3R+6K1RJER10="
        tags                           = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_sfn_state_machine.asset_inventory_cartography will be updated in-place
  ~ resource "aws_sfn_state_machine" "asset_inventory_cartography" {
      ~ definition    = jsonencode(
            {
              - Comment        = "Run daily asset inventory of cloud assets"
              - StartAt        = "Get AWS accounts"
              - States         = {
                  - "Get AWS accounts" = {
                      - Next           = "Map"
                      - Parameters     = {
                          - Name = "/cartography/asset_inventory_account_list"
                        }
                      - Resource       = "arn:aws:states:::aws-sdk:ssm:getParameter"
                      - ResultSelector = {
                          - "accounts.$" = "States.StringToJson($.Parameter.Value)"
                        }
                      - Type           = "Task"
                    }
                  - Map                = {
                      - End            = true
                      - ItemsPath      = "$.accounts"
                      - Iterator       = {
                          - StartAt = "Pass"
                          - States  = {
                              - Cartography = {
                                  - End        = true
                                  - Parameters = {
                                      - CapacityProviderStrategy = [
                                          - {
                                              - Base             = 1
                                              - CapacityProvider = "FARGATE_SPOT"
                                              - Weight           = 5
                                            },
                                          - {
                                              - Base             = 0
                                              - CapacityProvider = "FARGATE"
                                              - Weight           = 1
                                            },
                                        ]
                                      - Cluster                  = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
                                      - NetworkConfiguration     = {
                                          - AwsvpcConfiguration = {
                                              - SecurityGroups = [
                                                  - "sg-03caf974f268a3efb",
                                                ]
                                              - Subnets        = [
                                                  - "subnet-08cab5daf34489c53",
                                                  - "subnet-07f8e17bbf11b0797",
                                                  - "subnet-0d92713028fd15243",
                                                ]
                                            }
                                        }
                                      - Overrides                = {
                                          - ContainerOverrides = [
                                              - {
                                                  - Environment = [
                                                      - {
                                                          - Name      = "AWS_ACCOUNT"
                                                          - "Value.$" = "$.account"
                                                        },
                                                      - {
                                                          - Name  = "AWS_CONFIG_FILE"
                                                          - Value = "/config/role_config"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_URI"
                                                          - Value = "bolt://neo4j.internal.local:7687"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_USER"
                                                          - Value = "neo4j"
                                                        },
                                                    ]
                                                  - Name        = "cartography"
                                                },
                                            ]
                                        }
                                      - TaskDefinition           = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:4"
                                    }
                                  - Resource   = "arn:aws:states:::ecs:runTask.sync"
                                  - Retry      = [
                                      - {
                                          - ErrorEquals     = [
                                              - "States.TaskFailed",
                                            ]
                                          - IntervalSeconds = 120
                                          - MaxAttempts     = 4
                                        },
                                    ]
                                  - Type       = "Task"
                                }
                              - Pass        = {
                                  - Next       = "Cartography"
                                  - Parameters = {
                                      - "account.$" = "$"
                                    }
                                  - Type       = "Pass"
                                }
                            }
                        }
                      - MaxConcurrency = 1
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                }
              - TimeoutSeconds = 86400
            }
        ) -> (known after apply)
        id            = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
        name          = "asset-inventory-cartography"
        tags          = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
